<?php

use Illuminate\Database\Seeder;
use App\Currency;


class CurrencyTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $roles=[
            [  ///1
                'id' => '1',
                'c1' => 'دولار أمريكي',
                'c2' => 'شيكل إسرائيلي',
                'sale' => '3.2',
                'buy' => '5.4'
            ],
            [  ///2
                'id' => '2',
                'c1' => 'دولار أمريكي',
                'c2' => 'ريال سعودي',
                'sale' => '3.2',
                'buy' => '5.4'
            ],
            [  ///3
                'id' => '3',
                'c1' => 'دولار أمريكي',
                'c2' => 'جنيه مصري',
                'sale' => '3.2',
                'buy' => '5.4'
            ],
            [  ///4
                'id' => '4',
                'c1' => 'دولار أمريكي',
                'c2' => 'ليرة تركية',
                'sale' => '3.2',
                'buy' => '5.4'
            ],
            [  ///5
                'id' => '5',
                'c1' => 'شيكل إسرائيلي',
                'c2' => 'ريال سعودي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///6
                'id' => '6',
                'c1' => 'شيكل إسرائيلي',
                'c2' => 'جنيه مصري',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///7
                'id' => '7',
                'c1' => 'شيكل إسرائيلي',
                'c2' => 'ليرة تركية',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///8
                'id' => '8',
                'c1' => 'يورو اوروبي',
                'c2' => 'دولار أمريكي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///9
                'id' => '9',
                'c1' => 'يورو اوروبي',
                'c2' => 'شيكل إسرائيلي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///10
                'id' => '10',
                'c1' => 'يورو اوروبي',
                'c2' => 'ريال سعودي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///11
                'id' => '11',
                'c1' => 'يورو اوروبي',
                'c2' => 'دينار اردني',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///12
                'id' => '12',
                'c1' => 'يورو اوروبي',
                'c2' => 'جنيه مصري',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///13
                'id' => '13',
                'c1' => 'يورو اوروبي',
                'c2' => 'ليرة تركية',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///14
                'id' => '14',
                'c1' => 'دينار اردني',
                'c2' => 'جنيه مصري',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///15
                'id' => '15',
                'c1' => 'دينار اردني',
                'c2' => 'دولار أمريكي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///16
                'id' => '16',
                'c1' => 'دينار اردني',
                'c2' => 'ريال سعودي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///17
                'id' => '17',
                'c1' => 'دينار اردني',
                'c2' => 'ليرة تركية',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///18
                'id' => '18',
                'c1' => 'دينار اردني',
                'c2' => 'شيكل إسرائيلي',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///19
                'id' => '19',
                'c1' => 'ليرة تركية',
                'c2' => 'جنيه مصري',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///20
                'id' => '20',
                'c1' => 'ريال سعودي',
                'c2' => 'جنيه مصري',
                'sale' => '3.2',
                'buy' => '5.5'
            ],
            [  ///21
                'id' => '21',
                'c1' => 'ريال سعودي',
                'c2' => 'ليرة تركية',
                'sale' => '3.2',
                'buy' => '5.5'
            ]
        
        ];
        foreach ($roles as $key=>$value){
            Currency::create($value);
        }
    }
}
